update project README
